cmsis-svd/cmsis-svd/data/Renesas/R7FA4M1AB.svd
                <register>
                    <name>CTSUSSC</name>
                    <description>CTSU High-Pass Noise Reduction Spectrum Diffusion Control Register </description>
                    <addressOffset>0x12</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000. The write value should be 0000.</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSUSSDIV</name>
                            <description>CTSU Spectrum Diffusion Frequency Division Setting</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>4.00 &lt;= fb</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>2.00 &lt;= fb &lt; 4.00</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>1.33 &lt;= fb &lt; 2.00</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>1.00 &lt;= fb &lt; 1.33</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>0.80 &lt;= fb &lt; 1.00</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>0.67 &lt;= fb &lt; 0.80</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>0.57 &lt;= fb &lt; 0.67</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>0.50 &lt;= fb &lt; 0.57</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000</name>
                                    <description>0.44 &lt;= fb &lt; 0.50</description>
                                    <value>#1000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001</name>
                                    <description>0.40 &lt;= fb &lt; 0.44</description>
                                    <value>#1001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010</name>
                                    <description>0.36 &lt;= fb &lt; 0.40</description>
                                    <value>#1010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1011</name>
                                    <description>0.33 &lt;= fb &lt; 0.36</description>
                                    <value>#1011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1100</name>
                                    <description>0.31 &lt;= fb &lt; 0.33</description>
                                    <value>#1100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1101</name>
                                    <description>0.29 &lt;= fb &lt; 0.31</description>
                                    <value>#1101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1110</name>
                                    <description>0.27 &lt;= fb &lt; 0.29</description>
                                    <value>#1110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111</name>
                                    <description>fb &lt; 0.27</description>
                                    <value>#1111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSO0</name>
                    <description>CTSU Sensor Offset Register 0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSUSNUM</name>
                            <description>CTSU Measurement Count Setting</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSUSO</name>
                            <description>CTSU Sensor Offset Adjustment
Current offset amount is CTSUSO ( 0 to 1023 )</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSO1</name>
                    <description>CTSU Sensor Offset Register 1</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSUICOG</name>
                            <description>CTSU ICO Gain Adjustment</description>
                            <lsb>13</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>100 percent gain</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>66 percent gain</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>50 percent gain</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>40 percent gain</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTSUSDPA</name>
                            <description>CTSU Base Clock Setting
Operating clock divided by ( CTSUSDPA + 1 ) x 2</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTSURICOA</name>
                            <description>CTSU Reference ICO Current Adjustment
Current offset amount is CTSUSO ( 0 to 255 )</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSC</name>
                    <description>CTSU Sensor Counter</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSUSC</name>
                            <description>CTSU Sensor Counter
These bits indicate the measurement result of the CTSU. These bits indicate FFFFh when an overflow occurs.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSURC</name>
                    <description>CTSU Reference Counter</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSURC</name>
                            <description>CTSU Reference Counter
These bits indicate the measurement result of the reference ICO.
These bits indicate FFFFh when an overflow occurs.
</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUERRS</name>
                    <description>CTSU Error Status Register </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTSUICOMP</name>
                            <description>TSCAP Voltage Error Monitor</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal TSCAP voltage</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Abnormal TSCAP voltage</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000.</description>
                            <lsb>0</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
