cmsis-svd/cmsis-svd/data/Renesas/R7FA4M1AB.svd
                <register derivedFrom="P109PFS">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>14,15</dimIndex>
                    <name>P9%sPFS</name>
                    <description>P9%s Pin Function Control Register</description>
                    <addressOffset>0x278</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register derivedFrom="P109PFS_HA">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>14,15</dimIndex>
                    <name>P9%sPFS_HA</name>
                    <description>P9%s Pin Function Control Register</description>
                    <alternateRegister>P9%sPFS</alternateRegister>
                    <addressOffset>0x27A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register derivedFrom="P109PFS_BY">
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>14,15</dimIndex>
                    <name>P9%sPFS_BY</name>
                    <description>P9%s Pin Function Control Register</description>
                    <alternateRegister>P9%sPFS</alternateRegister>
                    <addressOffset>0x27B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PMISC</name>
            <description>Miscellaneous Port Control Register</description>
            <baseAddress>0x40040D00</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PWPR</name>
                    <description>Write-Protect Register</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>B0WI</name>
                            <description>PFSWE Bit Write Disable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Writing to the PFSWE bit is enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Writing to the PFSWE bit is disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PFSWE</name>
                            <description>PFS Register Write Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Writing to the PFS register is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Writing to the PFS register is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ICU</name>
            <description>Interrupt Controller</description>
            <baseAddress>0x40006000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>13</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0E</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x130</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x300</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>IEL0</name>
                <description>ICU Interrupt 0</description>
                <value>0</value>
            </interrupt>
            <interrupt>
                <name>IEL1</name>
                <description>ICU Interrupt 1</description>
                <value>1</value>
            </interrupt>
            <interrupt>
                <name>IEL2</name>
                <description>ICU Interrupt 2</description>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>IEL3</name>
                <description>ICU Interrupt 3</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>IEL4</name>
                <description>ICU Interrupt 4</description>
                <value>4</value>
            </interrupt>
            <interrupt>
                <name>IEL5</name>
                <description>ICU Interrupt 5</description>
                <value>5</value>
            </interrupt>
            <interrupt>
                <name>IEL6</name>
                <description>ICU Interrupt 6</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>IEL7</name>
                <description>ICU Interrupt 7</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>IEL8</name>
                <description>ICU Interrupt 8</description>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>IEL9</name>
                <description>ICU Interrupt 9</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>IEL10</name>
                <description>ICU Interrupt 10</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>IEL11</name>
                <description>ICU Interrupt 11</description>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>IEL12</name>
                <description>ICU Interrupt 12</description>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>IEL13</name>
                <description>ICU Interrupt 13</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>IEL14</name>
                <description>ICU Interrupt 14</description>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>IEL15</name>
                <description>ICU Interrupt 15</description>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>IEL16</name>
                <description>ICU Interrupt 16</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>IEL17</name>
                <description>ICU Interrupt 17</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>IEL18</name>
                <description>ICU Interrupt 18</description>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>IEL19</name>
                <description>ICU Interrupt 19</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>IEL20</name>
                <description>ICU Interrupt 20</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>IEL21</name>
                <description>ICU Interrupt 21</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>IEL22</name>
                <description>ICU Interrupt 22</description>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>IEL23</name>
                <description>ICU Interrupt 23</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>IEL24</name>
                <description>ICU Interrupt 24</description>
                <value>24</value>
            </interrupt>
            <interrupt>
                <name>IEL25</name>
                <description>ICU Interrupt 25</description>
                <value>25</value>
            </interrupt>
            <interrupt>
                <name>IEL26</name>
                <description>ICU Interrupt 26</description>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>IEL27</name>
                <description>ICU Interrupt 27</description>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>IEL28</name>
                <description>ICU Interrupt 28</description>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>IEL29</name>
                <description>ICU Interrupt 29</description>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>IEL30</name>
                <description>ICU Interrupt 30</description>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>IEL31</name>
                <description>ICU Interrupt 31</description>
                <value>31</value>
            </interrupt>
            <registers>
                <register>
                    <dim>13</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>0-12</dimIndex>
                    <name>IRQCR%s</name>
                    <description>IRQ Control Register %s</description>
                    <addressOffset>0x000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FLTEN</name>
                            <description>IRQ Digital Filter Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Digital filter disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Digital filter enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCLKSEL</name>
                            <description>IRQ Digital Filter Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>PCLKB</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>PCLKB/8</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>PCLKB/32</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>PCLKB/64</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQMD</name>
                            <description>IRQ Detection Sense Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Falling edge</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Rising edge</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Rising and falling edges</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Low level</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
