cmsis-svd/cmsis-svd/data/Renesas/R7FA4M1AB.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SCI2">
            <name>SCI9</name>
            <description>Serial Communication Interface 9</description>
            <baseAddress>0x40070120</baseAddress>
        </peripheral>
        <peripheral>
            <name>SLCDC</name>
            <description>Segment LCD Controller/Driver</description>
            <baseAddress>0x40082000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>38</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>LCDM0</name>
                    <description>LCD Mode Register 0 </description>
                    <addressOffset>0x000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MDSET</name>
                            <description>LCD drive voltage generator selection</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>External resistance division method</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Internal voltage boosting method</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Capacitor split method</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LWAVE</name>
                            <description>LCD display waveform selection</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Waveform A</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Waveform B</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LDTY</name>
                            <description>Time Slice of LCD Display Select</description>
                            <lsb>2</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Static</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>2-time slice</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>3-time slice</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>4-time slice</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>8-time slice</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LBAS</name>
                            <description>LCD Display Bias Method Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1/2 bias method</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1/3 bias method</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1/4 bias method</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCDM1</name>
                    <description>LCD Mode Register 1 </description>
                    <addressOffset>0x001</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LCDON</name>
                            <description>LCD Display Enable/Disable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Output ground level to segment/common pin(SCOC=0)/Display off (all segment outputs are deselected)(SCOC=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output ground level to segment/common pin(SCOC=0)/Display on(SCOC=1)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SCOC</name>
                            <description>LCD Display Enable/Disable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Output ground level to segment/common pin(LCDON=0)/Output ground level to segment/common pin(LCDON=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Display off (all segment outputs are deselected)(LCDON=0)/Display on(LCDON=1)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VLCON</name>
                            <description>Voltage boost circuit or capacitor split circuit operation enable/disable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stops voltage boost circuit or capacitor split circuit operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables voltage boost circuit or capacitor split circuit operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BLON</name>
                            <description>Display data area control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Displaying an A-pattern area data (lower four bits of LCD display data register)(LCDSEL=0)/Displaying a B-pattern area data (higher four bits of LCD display data register)(LCDSEL=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Alternately displaying A-pattern and B-pattern area data (blinking display corresponding to the constant-period interrupt (INTRTC) timing of the real-time clock (RTC))</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LCDSEL</name>
                            <description>Display data area control</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Displaying an A-pattern area data (lower four bits of LCD display data register)(BLON=0)/Alternately displaying A-pattern and B-pattern area data (blinking display corresponding to the constant-period interrupt (INTRTC) timing of the real-time clock (RTC))(BLON=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Displaying a B-pattern area data (higher four bits of LCD display data register)(BLON=0)/Alternately displaying A-pattern and B-pattern area data (blinking display corresponding to the constant-period interrupt (INTRTC) timing of the real-time clock (RTC))(BLON=1)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>1</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LCDVLM</name>
                            <description>Voltage Boosting Pin Initial Value Switching Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Set when VDD &gt;= 2.7 V</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Set when VDD &lt;= 4.2 V </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCDC0</name>
                    <description>LCD Clock Control Register 0 </description>
                    <addressOffset>0x002</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LCDC</name>
                            <description>LCD clock (LCDCL)</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000001</name>
                                    <description>(Sub clock)/22  or  (LOCO clock)/22</description>
                                    <value>#000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000010</name>
                                    <description>(Sub clock)/23  or  (LOCO clock)/23</description>
                                    <value>#000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000011</name>
                                    <description>(Sub clock)/24  or  (LOCO clock)/24 </description>
                                    <value>#000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000100</name>
                                    <description>(Sub clock)/25  or  (LOCO clock)/25 </description>
                                    <value>#000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000101</name>
                                    <description>(Sub clock)/26  or  (LOCO clock)/26 </description>
                                    <value>#000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000110</name>
                                    <description>(Sub clock)/27  or  (LOCO clock)/27</description>
                                    <value>#000110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000111</name>
                                    <description>(Sub clock)/28  or  (LOCO clock)/28</description>
                                    <value>#000111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001000</name>
                                    <description>(Sub clock)/29  or  (LOCO clock)/29</description>
                                    <value>#001000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001001</name>
                                    <description>(Sub clock)/210 or  (LOCO clock)/210</description>
                                    <value>#001001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010001</name>
                                    <description>(Main clock)/28 or  (HOCO clock)/28 </description>
                                    <value>#010001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010010</name>
                                    <description>(Main clock)/29 or  (HOCO clock)/29</description>
                                    <value>#010010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010011</name>
                                    <description>(Main clock)/210 or  (HOCO clock)/210</description>
                                    <value>#010011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010100</name>
                                    <description>(Main clock)/211 or  (HOCO clock)/211</description>
                                    <value>#010100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010101</name>
                                    <description>(Main clock)/212 or  (HOCO clock)/212</description>
                                    <value>#010101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010110</name>
                                    <description>(Main clock)/213 or  (HOCO clock)/213 </description>
                                    <value>#010110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010111</name>
                                    <description>(Main clock)/214 or  (HOCO clock)/214</description>
                                    <value>#010111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011000</name>
                                    <description>(Main clock)/215 or  (HOCO clock)/215</description>
                                    <value>#011000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011001</name>
                                    <description>(Main clock)/216 or  (HOCO clock)/216</description>
                                    <value>#011001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011010</name>
                                    <description>(Main clock)/217 or  (HOCO clock)/217</description>
                                    <value>#011010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011011</name>
                                    <description>(Main clock)/218 or  (HOCO clock)/218</description>
                                    <value>#011011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101011</name>
                                    <description>(Main clock)/219 or  (HOCO clock)/219</description>
                                    <value>#101011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Other than above Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
